import React from 'react';

import { Card } from 'reactstrap';

import './term.css';

export const terms = (
    <Card scroll className="terms">
<b>제1장 총칙</b> <br/>
제1조(목적)<br/>
본 약관은 SNUVOICE가 제공하는 관련 제반 서비스의 이용과 관련하여 회원과 SNUVOICE 사이의 권리·의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 한다. <br/>
<br/>
제2조(정의)<br/>
이 약관에서 사용하는 용어의 정의는 다음 각 호와 같다.<br/>
1. 서비스라 함은 구현되는 단말기(PC, 휴대형단말기 등의 각종 유무선 장치를 포함)와 상관없이 회원이 이용할 수 있는 SNUVOICE 관련 제반 서비스를 의미한다.<br/>
2. 회원이라 함은 SNUVOICE의 서비스에 접속하여 이 약관에 따라 SNUVOICE와 이용계약을 체결하고 SNUVOICE가 제공하는 서비스를 이용하는 자를 의미한다.<br/>
3. 아이디(ID)라 함은 회원의 식별과 서비스 이용을 위하여 회원이 정하고 SNUVOICE가 승인하는 문자와 숫자의 조합을 의미한다.<br/>
4. 비밀번호라 함은 회원이 부여 받은 아이디와 일치되는 회원임을 확인하고 비밀보호를 위해 회원 자신이 정한 문자 또는 숫자의 조합을 의미한다.<br/>
5. 게시물이라 함은 회원이 서비스를 이용함에 있어 서비스상에 게시한 부호ㆍ문자ㆍ음성ㆍ음향ㆍ화상ㆍ동영상 등의 정보 형태의 글, 사진, 동영상 및 각종 파일과 링크 등을 의미한다.<br/>
6. 서울대학교 구성원이라 함은 학부생, 대학원생, 졸업생, 교원 등을 의미한다. 구성원 인증이란 이와 같은 구성원인지 여부를 확인하는 절차를 말한다.<br/>
<br/>
<b>제2장 회원</b><br/>
제3조(회원의 종류)<br/>
① 회원의 종류는 다음 각 호에 따라 구분한다.<br/>
1. 정식회원 : 아이디와 비밀번호로 자신임을 인증할 수 있는 회원<br/>
2. 임시회원 : 아이디와 비밀번호를 등록하지 않아 자신임을 인증할 수 없는 회원<br/>
<br/>
제4조(회원의 가입)<br/>
① 회원이 되고자 하는 자는 SNUVOICE가 정한 가입 양식에 따라 회원정보를 기입하고 가입하기 버튼을 누르는 방법으로 회원 가입을 신청한다.<br/>
② SNUVOICE는 제1항과 같이 회원으로 가입할 것을 신청한 자가 서울대학교 구성원에 해당하고 다음 각 호에 해당하지 않는 한 신청한 자의 서비스 이용을 승낙한다.<br/>
1. 가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 단 SNUVOICE의 회원 재가입 승낙을 얻은 경우에는 예외로 함.<br/>
2. 허위의 정보를 기재하거나, SNUVOICE가 제시하는 내용을 기재하지 않은 경우<br/>
3. 이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우<br/>
③ 제1항에 따른 신청에 있어 SNUVOICE는 가입여부에 대한 기록을 알리지 않는 선에서 본부 측에 서울대학교 구성원 여부의 인증을 요청할 수 있다.<br/>
④ SNUVOICE는 서비스관련설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있다.<br/>
⑤ 제2항과 제4항에 따라 회원가입신청의 승낙을 하지 아니하거나 유보한 경우, SNUVOICE는 원칙적으로 이를 가입신청자에게 알린다.<br/>
⑥ 이용계약의 성립 시기는 SNUVOICE가 가입완료를 신청절차 상에서 표시한 시점으로 한다.<br/>
<br/>
제5조(회원의 탈퇴와 자격 상실)<br/>
① 회원은 SNUVOICE에 언제든지 자신의 등록을 말소해 줄 것(회원 탈퇴)을 요청할 수 있으며 SNUVOICE는 위 요청을 받은 즉시 해당 이용자의 회원 등록 말소를 위한 절차를 밟아야 한다. 단, 탈퇴 후에는 특별한 사유 없이 재가입할 수 없다.<br/>
② 회원이 다음 각 호의 사유에 해당하는 경우, SNUVOICE는 회원 자격을 적절한 방법으로 제한 및 정지, 상실시킬 수 있다.<br/>
1. 가입 신청 시에 허위 내용을 등록한 경우<br/>
2. 다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등 인터넷 통신질서를 위협하는 경우<br/>
3. 서비스를 이용하여 본 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우<br/>
<br/>
제6조(회원에 대한 통지)<br/>
① SNUVOICE가 특정 혹은 불특정 회원에 대한 통지를 하는 경우 알림을 이용한다.<br/>
② SNUVOICE는 회원이 서비스 이용에 필요하다고 인정되는 다양한 정보를 회원이 제공한 전자우편 주소로 제공할 수 있다.<br/>
③ SNUVOICE는 다음 각 호의 사유에 해당하는 경우, 회원의 동의여부와 상관없이 전자우편으로 발송할 수 있다.<br/>
1. 이용 신청에서 입력한 전자우편 주소의 소유를 확인하기 위해서 인증메일을 발송하는 경우<br/>
2. 회원의 정보가 변경되어 확인하기 위해서 인증메일을 발송하는 경우<br/>
3. 기타 서비스를 제공함에 있어 회원이 반드시 알아야 하는 중대한 정보라고 SNUVOICE가 판단하는 경우<br/>
<br/>
<b>제3장 서비스</b><br/>
제7조(서비스의 제공)<br/>
SNUVOICE는 회원에게 아래와 같은 서비스를 제공한다.<br/>
1. 서울대 위키 서비스<br/>
2. 서울대 청원 서비스<br/>
3. 기타 “SNUVOICE”가 자체 개발하거나 다른 회사와의 협력 계약 등을 통해 회원들에게 제공할 일체의 서비스<br/>
<br/>
제8조(서비스의 중단)<br/>
① SNUVOICE는 컴퓨터 등 정보통신설비의 보수점검·교체 및 고장, 통신의 두절 등의 경우에는 서비스의 제공을 일시적으로 중단할 수 있고, 새로운 서비스로의 교체 및 기타 SNUVOICE가 적절하다고 판단하는 경우 현재 제공되는 서비스를 완전히 중단할 수 있다.<br/>
② 제1항에 의한 서비스 중단의 경우 SNUVOICE는 제6조 제1항에서 정한 방법으로 회원에게 통지한다. 단, SNUVOICE가 통제할 수 없는 사유로 인한 서비스의 중단(시스템 관리자의 고의 또는 과실이 없는 디스크 장애, 시스템 다운, 천재지변 등)으로 인하여 사전 통지가 불가능한 경우는 예외로 한다.<br/>
<br/>
<b>제4장 권리와 의무</b><br/>
제9조(이용자의 개인정보보호)<br/>
SNUVOICE는 회원의 등록정보를 포함한 회원들의 개인정보를 보호하기 위하여 노력한다. 회원의 개인정보보호에 관해서는 SNUVOICE가 별도로 정하는 개인정보보호정책에 정한 바에 의한다.<br/>
<br/>
제10조(SNUVOICE의 의무)<br/>
① SNUVOICE는 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 본 약관이 정하는 바에 따라 지속적이고, 안정적으로 서비스를 제공하기 위해서 노력한다.<br/>
② SNUVOICE는 이용자가 안전하게 인터넷 서비스를 이용할 수 있도록 이용자의 개인정보(신용정보 포함) 보호를 위한 보안 시스템을 구축한다.<br/>
③ SNUVOICE는 이용자가 서비스를 이용함에 있어 SNUVOICE의 고의 또는 중대한 과실로 인하여 입은 손해를 배상할 책임을 부담한다.<br/>
<br/>
제11조(광고 및 제휴)<br/>
① SNUVOICE는 회원들의 이용에 불편함이 없는 선에서 광고를 게시하여 그 수익을 SNUVOICE의 운영비로 충당할 수 있다.<br/>
② “SNUVOICE”는 더 나은 서비스 제공을 위하여 다른 회사와 제휴할 수 있다.<br/>
<br/>
제12조(이용자의 ID 및 비밀번호에 대한 의무)<br/>
① SNUVOICE가 관계법령, 개인정보보호정책에 의해서 그 책임을 지는 경우를 제외하고, 자신의 ID와 비밀번호에 관한 관리책임은 각 회원에게 있다.<br/>
② 회원은 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안 된다.<br/>
③ 회원은 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 SNUVOICE에 통보하고 SNUVOICE의 안내가 있는 경우에는 그에 따라야 한다.<br/>
<br/>
제13조(회원의 의무)<br/>
① 회원은 다음 각 호의 행위를 하여서는 안 된다.<br/>
1. 회원가입신청 또는 회원정보 변경 시 허위내용을 등록하는 행위<br/>
2. SNUVOICE에 게시된 정보를 허위로 변경하는 행위<br/>
3. SNUVOICE 및 기타 제3자의 인격권 또는 지적재산권을 침해하거나 업무를 방해하는 행위<br/>
4. “SNUVOICE”의 대표나 “SNUVOICE” 서비스의 관리자를 가장하여 글을 게시하거나 메일을 발송하는 행위<br/>
5. 컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해, 파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파일, 프로그램을 포함하고 있는 자료를 게시하는 행위<br/>
6. 스토킹(stalking) 등 다른 이용자를 괴롭히는 행위<br/>
7. 다른 이용자에 대한 개인정보를 동의 없이 수집, 저장, 공개하는 행위<br/>
8. SNUVOICE의 서비스를 이용하여 영리목적의 활동을 하는 행위<br/>
9. 기타 SNUVOICE가 제공하는 서비스에 정한 약관을 위반하는 행위<br/>
② 제1항에 해당하는 행위를 한 회원이 있을 경우 SNUVOICE는 당해 회원의 회원 자격을 제5조에 따라 제한, 정지 또는 상실시킬 수 있다.<br/>
<br/>
제14조(공개게시물의 삭제)<br/>
① 회원의 공개게시물의 내용이 다음 각 호에 해당하는 경우 SNUVOICE는 회원에게 사전 통지 없이 해당 공개게시물을 삭제할 수 있고, 해당 이용자의 회원 자격을 제한, 정지 또는 상실시킬 수 있다.<br/>
1. 비방, 인신공격, 욕설, 반말을 비롯해 타인에게 심한 모욕을 주거나 명예를 손상시키는 게시물<br/>
2. 성적 모멸감과 불쾌감을 일으키는 게시물<br/>
3. 허위 사실을 유포하기 위한 게시물<br/>
4. 낚시나 도배로 서비스 이용에 불편을 주는 게시물<br/>
5. 다른 이용자 또는 제3자의 저작권을 침해하는 게시물<br/>
6. 다른 이용자 또는 제3자의 사생활을 침해하는 게시물<br/>
7. 시스템이나 사이트 보안에 문제를 일으킬 우려가 있는 게시물<br/>
8. 영리를 목적으로 하는 게시물<br/>
9. 게시판 성격에 맞지 않는 게시물<br/>
10. 신고를 받은 게시물 중 신고에 문제가 없는 게시물<br/>
② 회원의 공개게시물로 인한 법률상 이익 침해를 근거로, 다른 이용자 또는 제3자가 이용자 또는 “SNUVOICE”를 대상으로 하여 민형사상의 법적 조치(예: 고소, 가처분신청, 손해배상청구소송)을 취하는 동시에 법적 조치와 관련된 게시물의 삭제를 요청해오는 경우, “SNUVOICE”는 동 법적 조치의 결과(예: 검찰의 기소, 법원의 가처분결정, 손해배상판결)가 있을 때까지 관련 게시물에 대한 접근을 잠정적으로 제한할 수 있다.<br/>
<br/>
제15조(저작권의 귀속 및 이용제한)<br/>
① 서비스에 대한 저작권 및 지적재산권은 SNUVOICE에 귀속된다.<br/>
② 회원이 서비스 내에 게시한 게시물 내용의 저작권은 해당 게시물의 저작자에게 귀속된다. 단, 게시물 내용 외의 레이아웃, 디자인 등의 저작권은 SNUVOICE에 귀속된다.<br/>
③ 회원은 SNUVOICE를 이용함으로써 얻은 정보를 SNUVOICE의 사전승낙 없이 복제, 전송, 출판, 배포, 방송, 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안된다.<br/>
<br/>
<b>제5장 약관의 개정과 분쟁의 조정</b><br/>
제16조(약관의 개정)<br/>
① SNUVOICE는 「약관의 규제 등에 관한 법률」, 「정보통신망이용촉진 등에 관한 법률」 등 관련 법률을 위배하지 않는 범위에서 본 약관을 개정할 수 있다.<br/>
② SNUVOICE이 본 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 초기화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지한다.<br/>
③ 회원은 변경된 약관에 대해 변경된 약관이 공지 된 때로부터 15일까지 거부할 권리가 있다. 이 경우 SNUVOICE는 당해 회원과의 계약을 해지할 수 있다. 변경된 약관이 공지된 후 15일 이내에 거부의사를 표시하지 않는 회원은 당해 약관 개정에 동의하는 것으로 간주한다.<br/>
<br/>
제17조(면책조항)<br/>
① 다음과 같은 사유가 있을 경우 SNUVOICE는 책임을 면제받을 수 있다.<br/>
1. SNUVOICE는 천재 지변, 전쟁 및 기타 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 대한 책임이 면제된다.<br/>
2. SNUVOICE는 기간통신 사업자가 전기통신 서비스를 중지하거나 정상적으로 제공하지 아니하여 손해가 발생한 경우 책임이 면제된다.<br/>
3. SNUVOICE는 서비스용 설비의 보수, 교체, 정기점검, 공사 등 부득이한 사유로 발생한 손해에 대한 책임이 면제된다.<br/>
4. SNUVOICE는 회원의 귀책 사유로 인한 서비스 이용의 장애 또는 손해에 대하여 책임을 지지 않는다.<br/>
5. SNUVOICE는 이용자의 컴퓨터 오류에 의해 손해가 발생한 경우, 또는 회원이 개인정보를 부실하게 기재하여 손해가 발생한 경우 책임을 지지 않는다.<br/>
6. SNUVOICE는 회원이 서비스를 이용하면서 얻은 자료로 인한 손해에 대하여 책임을 지지 않는다. 또한 SNUVOICE는 서비스를 이용하며 타 회원으로 인해 입게 되는 정신적 피해에 대하여 보상할 책임을 지지 않는다.<br/>
7. SNUVOICE는 회원이 서비스에 게재한 각종 정보, 자료, 사실의 신뢰도, 정확성 등 내용에 대하여 책임을 지지 않는다.<br/>
8. SNUVOICE는 이용자 상호간 및 이용자와 제3자 상호 간에 서비스를 매개로 발생한 분쟁에 대해 개입할 의무가 없으며 이로 인한 손해를 배상할 책임도 없다.<br/>
9. SNUVOICE는 회원에게 무료로 제공하는 서비스의 이용과 관련해서는 어떠한 손해도 책임을 지지 않는다.<br/>
<br/>
제18조(재판관할)<br/>
SNUVOICE과 이용자 간에 발생한 서비스 이용에 관한 분쟁에 대하여는 대한민국 법을 적용하며, 본 분쟁으로 인한 소는 민사소송법상의 관할을 가지는 대한민국의 법원에 제기한다.
</Card>
)

export default terms;